#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.ecr-app-repo will be created
  + resource "aws_ecr_repository" "ecr-app-repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "default-flask-chatrrr-app-ecr-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.ecr-nginx-repo will be created
  + resource "aws_ecr_repository" "ecr-nginx-repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "default-flask-chatrrr-nginx-ecr-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_repository_name   = (sensitive value)
  + nginx_repository_name = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

#### Terraform Apply 🚀`success`
<details><summary>Show Apply</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.ecr-app-repo will be created
  + resource "aws_ecr_repository" "ecr-app-repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "default-flask-chatrrr-app-ecr-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.ecr-nginx-repo will be created
  + resource "aws_ecr_repository" "ecr-nginx-repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "default-flask-chatrrr-nginx-ecr-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_repository_name   = (sensitive value)
  + nginx_repository_name = (sensitive value)
aws_ecr_repository.ecr-app-repo: Creating...
aws_ecr_repository.ecr-nginx-repo: Creating...
aws_ecr_repository.ecr-app-repo: Creation complete after 1s [id=default-flask-chatrrr-app-ecr-repo]
aws_ecr_repository.ecr-nginx-repo: Creation complete after 1s [id=default-flask-chatrrr-nginx-ecr-repo]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

app_repository_name = <sensitive>
nginx_repository_name = <sensitive>

```

</details>

*Pusher: @chiemerieezechukwu, Action: `pull_request`, Working Directory: ``, Workflow: `Provision AWS ECR, build and push image to AWS ECR`*